app/controllers/books_controller.rb

    def create
    	@book = Book.new(book_params)
        @books = Book.all
        @book.user_id = current_user.id
        @user = User.new
        if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaa"], ["user_id", 1], ["created_at", "2020-02-27 02:11:25.688357"], ["updated_at", "2020-02-27 02:11:25.688357"]]

    def index
    	@book = Book.new
        @user = User.new
        method = params[:search_method]
        search = params[:search_word]
        target = params[:search_target]
        if target == "book"
            @books = Book.search(method,search)
---
SELECT "books".* FROM "books"