app/controllers/post_comments_controller.rb

	def create
		book = Book.find(params[:book_id])
   		comment = current_user.post_comments.new(post_comment_params)
    	comment.book_id = book.id
    	comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaaaaaaaaaaaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-02-27 02:11:33.965395"], ["updated_at", "2020-02-27 02:11:33.965395"]]

	def destroy
		@book = Book.find(params[:book_id])
		@post_comment = @book.post_comments.find(params[:id])
    	@post_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ? AND "post_comments"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]