app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		@books = @user.books.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]

	def index
		@user = User.new
		method = flash[:f_users]
		search = flash[:w_users]
		@users = User.search(method,search)
---
SELECT "users".* FROM "users"

	def update
		@user = User.find(params[:id])
    	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "postcode" = ?, "prefecture_code" = ?, "address_city" = ?, "address_street" = ?, "updated_at" = ? WHERE "users"."id" = ?