app/views/layouts/_comment.html.erb

            <div class="float-wrapper">
                <h2 class="comment-count"><%= book.post_comments.count %>件コメント</h2>
---
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ? AND "post_comments"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]

<ol>
    <% book.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]

                        <span class="comment-meta">
                          <span class="comment-date"><%= post_comment.created_at.strftime('%Y/%m/%d') %></span>
---
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaaaaaaaaaaaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-02-27 02:11:33.965395"], ["updated_at", "2020-02-27 02:11:33.965395"]]